Пространство имен - способ избежать конфликта между классами, константами или функциями собственного производства и
сторонними либо встроенными если они имеют одинаковые названия. Для этого с помощью пространства имен можно указать на
конкретный файл с классом/константой/функцией.

Исключения - объекты класса Exeption (и его родственников). Позволяют качественнее и продуктивнее работать с ошибками,
в том числе обрабатывать и производить необходимые действия в случае их возникновения. Не прерывают исполнение программы
(если этого не требуется), исключений может быть поймано много, в отличие от фатальных ошибок, например.